{
  "lang": {
    "direction": "ltr"
  },
  "NotFoundPage": {
    "title": "الصفحة غير موجودة",
    "description": "عذراً! يبدو أنك وصلت إلى صفحة غير موجودة. لا تقلق، فإن تعدد اللغات لدينا ما زال يعمل بجد على أجزاء أخرى من التطبيق. لا تتردد في العودة لاستكشاف المزيد!"
  },
  "announcement": {
    "content": "مجموعة جديدة متاحة الآن!"
  },
  "navigation": {
  "home": "الرئيسية",
  "services": "خدماتنا",
  "about": "من نحن",
  "pr": "منتجاتنا",
  "contact": "تواصل معنا"
  },
  "heroSection": {
    "title": "اكتشف أفخر الأقمشة",
    "description": "نحن ملتزمون بتوفير أقمشة عالية الجودة ."
  },
  "servicesSection": {
    "title": "خدماتنا",
    "servicesList": [
      {
        "id": 1,
        "image": "/images/fabric-manufacturing1.jpg",
        "title": "صناعة الأقمشة",
        "description": "منشأتنا لتصنيع الأقمشة مزودة بأحدث التقنيات , تجمع بين التقنيات التقليدية والحديثة لإنتاج أقمشة عالية الجودة. من المواد الخام إلى المنتج النهائي، كل خطوة تُدار بدقة لضمان المتانة والأناقة."
      },
      {
        "id": 2,
        "image": "/images/fabric-dyeing.jpg",
        "title": "صباغة الأقمشة",
        "description": "عملية صبغ الأقمشة لدينا تعتمد مواد صديقة للبيئة وتقنيات مبتكرة لتحقيق ألوان زاهية طويلة الأمد. نحن نولي اهتمامًا كبيرًا بالاستدامة والسلامة، مما يضمن أن تكون أقمشتنا جميلة ومسؤولة بيئيًا."
      },
      {
        "id": 3,
        "image": "/images/fabric-weaving.jpg",
        "title": "نسج الأقمشة",
        "description": "عملية النسيج لدينا حيث يلتقي الحرفية بالدقة. باستخدام أفضل المواد، يقوم خبراؤنا بنسج أنماط وأنسجة معقدة تضفي الحياة على أقمشتنا. كل قطعة هي شهادة على التزامنا بالجودة والتميز."
      }
    ]
  },
  "aboutSection": {
    "title": "معلومات عنا",
    "image": "/images/about-pic.jpg",
    "introduction": "مرحباً بكم في شركتنا، حيث تلتقي التقليد بالابتكار في عالم النسيج. بخبرة تمتد عقودًا في تصنيع الأقمشة وصبغها ونسجها، نحن ملتزمون بتقديم أعلى مستويات الجودة لمنتجاتنا لعملائنا.",
    "commitment": "بدأت رحلتنا بشغف للأقمشة ورؤية لإنشاء علامة تجارية تقدر الحرفية والاستدامة ورضا العملاء. نعتقد أن جودة النسيج يمكن أن تحول المنتج. لهذا السبب نستثمر في أفضل المواد الخام ونوظف الحرفيين المهرة الذين يفخرون بعملهم. تتمتع منشآتنا بتقنيات متقدمة لضمان الدقة والتميز في كل مرحلة من مراحل الإنتاج.",
    "sustainability": "من التحصيل إلى التصنيع، نسعى لتقليل أثرنا البيئي مع تقديم أقمشة زاهية ودائمة وجميلة",
    "productsRange": "سواء كنت تبحث عن حرير فاخر، أو قطن متين، أو مزيجات مبتكرة، ستجد شيئًا يناسب احتياجاتك في مجموعتنا الواسعة.",
    "conclusion": "نتطلع إلى أن نكون جزءًا من رحلتك الإبداعية ومساعدتك في تحقيق رؤاك بأقمشتنا الاستثنائية.",
    "aboutSectionElements": {
      "title": "معلومات عنا",
      "introduction": "مقدمة",
      "commitment": "الالتزام",
      "sustainability": "الاستدامة",
      "productsRange": "مجموعة المنتجات",
      "conclusion": "كن شريكًا معنا"
    }
  },
  "productsSection": {
    "title": "منتجاتنا",
    "productsList": [
      {
        "id": 1,
        "name": "القطن",
        "description": "اكتشف قماش القطن عالي الجودة لدينا، مثالي للباس اليومي والمنسوجات المنزلية. مشهور بنعومته وقدرته على التنفس ومتانته، هذا القماش مثالي لصناعة الملابس المريحة، والفراش المريح، وديكور المنزل الأنيق. اختبر الراحة الطبيعية والتنوع لقماش القطن الفاخر لدينا، الذي يعتبر أساسًا لكل عاشق للأقمشة.",
        "pictures": ["/images/cotton/cotton1.jpg", "/images/cotton/cotton2.jpg", "/images/cotton/cotton3.jpg", "/images/cotton/cotton-plant.jpg"]
      },
      {
        "id": 2,
        "name": "الكتان",
        "description": "ارتقِ بمشاريعك باستخدام قماش الكتان الفاخر لدينا، المعروف بقوته وقدرته على التنفس. يوفر هذا القماش الأنيق إحساسًا بالبرودة والراحة، مما يجعله مثاليًا للملابس الأنيقة، والمفارش المتطورة، والستائر الناعمة. يجمع قماشنا من الكتان بين الوظائفية والأناقة، مثالي لأي إبداع رفيع المستوى.",
        "pictures": ["/images/linen/linen1.jpeg", "/images/linen/linen2.jpg", "/images/linen/linen3.jpg", "/images/linen/linen.jpeg", "/images/linen/flax-plants-linen.jpeg"]
      },
      {
        "id": 3,
        "name": "الحرير",
        "description": "تذوق رفاهية قماش الحرير الفاخر لدينا، الذي يتميز بنسيجه الناعم ولمعانه الجذاب. يعلو هذا القماش الراقي بشكل جميل، مما يجعله مثاليًا للملابس المسائية الأنيقة، والأوشحة الفاخرة، والإكسسوارات الرقيقة. استمتع بالأناقة والفخامة غير المضاهى لقماش الحرير الفاخر لدينا، المثالي لمشاريعك الأرقى.",
        "pictures": ["/images/silk/silk1.jpg", "/images/silk/silk2.jpg", "/images/silk/silk3.jpg"]
      },
      {
        "id": 4,
        "name": "الصوف",
        "description": "قماش الصوف عالي الجودة لدينا مثالي لصنع الملابس الدافئة والمتينة. المعروف بخصائصه الممتازة في العزل الحراري، يعد هذا القماش مثاليًا لصناعة السترات الدافئة، والمعاطف القوية، والقبعات الأنيقة. استمتع بالدفء الطبيعي والمتانة لقماش الصوف الفاخر لدينا، المناسب لكل من المشاريع الأنيقة والوظيفية.",
        "pictures": ["/images/wool/wool1.jpg", "/images/wool/wool2.jpg", "/images/wool/wool3.jpg"]
      },
      {
        "id": 5,
        "name": "البوليستر",
        "description": "استكشف تنوع قماش البوليستر لدينا، المعروف بمتانته وسهولة العناية به. يعد هذا القماش مثاليًا لمجموعة واسعة من التطبيقات، من الملابس اليومية إلى المنسوجات المنزلية. بفضل مقاومته للتجاعيد والانكماش، يعد قماش البوليستر خيارًا عمليًا لأساليب الحياة النشطة والإبداعات ذات الطول العمر.",
        "pictures": ["/images/polyester/polyester1.jpg", "/images/polyester/polyester2.jpg", "/images/polyester/polyester3.jpg"]
      },
      {
        "id": 6,
        "name": "الدينيم",
        "description": "قماش الدينيم القوي لدينا هو المفضل الزمني لصنع الملابس المتينة والأنيقة. مثالي لصناعة الجينز، والسترات، والإكسسوارات، يوفر هذا القماش الراحة والطول العمر. تبنَّى جاذبية الكلاسيكية والتنوع لقماش الدينيم الفاخر لدينا، الضروري لأي مشروع يتبع أحدث صيحات الموضة.",
        "pictures": ["/images/denim/denim1.jpg", "/images/denim/denim2.jpg", "/images/denim/denim3.jpg", "/images/denim/denim-making.jpg"]
      },
      {
        "id": 7,
        "name": "الرايون",
        "description": "اكتشف نعومة قماش الرايون لدينا، المثالي لمجموعة متنوعة من التطبيقات. يتميز الرايون بملمسه الناعم وتعلقه الساحر، مما يجعله مثاليًا لصناعة الفساتين الفضفاضة، والبلوزات الخفيفة، والملابس المريحة للمنزل. استمتع بالشعور الفاخر والتنوع لقماش الرايون الفاخر لدينا، الضروري لمشروعك الخياطي التالي.",
        "pictures": ["/images/rayon/rayon1.jpg", "/images/rayon/rayon2.jpg", "/images/rayon/rayon3.jpg"]
      }
    ]
  },
  "contactSection": {
  "title": "اتصل بنا",
  "description": "هل لديك أسئلة أو استفسارات؟ لا تتردد في التواصل معنا. فريقنا هنا لمساعدتك.",
  "emailPlaceHolder": "البريد الإلكتروني",
  "messagePlaceHolder": "رسالة"  
  },
  "footerSection": {
    "presentation": "نحن ملتزمون بتقديم أقمشة عالية الجودة لكل احتياج.",
    "email": "contact@fabriccompany.com",
    "whatsApp": "+1234567890",
    "phoneNumber": "+0987654321",
    "address": "123 شارع القماش، مدينة النسيج، تكساس 12345",
    "copyright": "اسم الشركة"
  }
}
